Autodesk.Revit.DB.PointOnEdgeEdgeIntersection.SetEdgeReference2(Autodesk.Revit.DB.Reference)
Change the second edge or curve reference.
Remarks: The referenced element may be any model element, including
FamilyInstance, FormElement, or NonPlanarSketch. The reference
must be of type ElementReferenceType.REFERENCE_TYPE_LINEAR,
and it must correspond to a straight line.

Autodesk.Revit.DB.PointOnEdgeEdgeIntersection.GetEdgeReference2
Get a copy of the second edge or curve reference.

Autodesk.Revit.DB.PointOnEdgeEdgeIntersection.SetEdgeReference1(Autodesk.Revit.DB.Reference)
Change the first edge or curve reference.
Remarks: The referenced element may be any model element, including
FamilyInstance, FormElement, or NonPlanarSketch. The reference
must be of type ElementReferenceType.REFERENCE_TYPE_LINEAR,
and it must correspond to a straight line.

Autodesk.Revit.DB.PointOnEdgeEdgeIntersection.GetEdgeReference1
Get a copy of the first edge or curve reference.

Autodesk.Revit.DB.PointOnEdgeEdgeIntersection
Define a ReferencePoint at the intersection of two
referenceable lines.
Remarks: The ReferencePoint is actually placed on the first
line (Edge1) at the closest point to the second line (Edge2).
Its X basis vector is constrained to be parallel to the first
line.